//ver 1.0

public var provArr:Array	=	["北京","上海","天津","重庆","河北省","山西省",
						"内蒙古自治区","辽宁省","吉林省","黑龙江省","江苏省","浙江省","安徽省",
						"江西省","福建省","山东省","河南省","湖北省","湖南省","广东省","云南省",
						"广西壮族自治区","海南省","四川省","贵州省","西藏自治区","陕西省",
						"甘肃省", "青海省", "宁夏回族自治区", "新疆维吾尔自治区", "香港", "澳门", "台湾"];
					
public var cityObj:Object = {直辖市或省级行政特区:["北京","上海","天津","重庆","香港","澳门","台湾"],
		北京:["北京"],上海:["上海"],天津:["天津"],重庆:["重庆"],
		河北省:["石家庄","保定","秦皇岛","邯郸","承德","廊坊","张家口","沧州","邢台","唐山","其它"],
		山西省:["太原","长治","大同","临汾","山阴","忻州","阳泉","原平","泽州","太谷","其它"],
		内蒙古自治区:["呼和浩特","包头","乌海","临河","东胜","赤峰","通辽","锡林浩特","乌兰浩特","海拉尔","其它"],
		辽宁省:["沈阳","大连","鞍山","抚顺","本溪","丹东","锦州","营口","辽阳","铁岭","其它"],
		吉林省:["长春","白城","松原","四平","吉林","辽源","白山","通化","延边","其它"],
		黑龙江省:["哈尔滨","大庆","黑河","鸡西","佳木斯","牡丹江","嫩江","齐齐哈尔","绥化","伊春","其它"],
		江苏省:["南京","苏州","无锡","常州","镇江","扬州","南通","徐州","连云港","淮阴","其它"],
		浙江省:["杭州","金华","宁波","温州","湖州","绍兴","嘉兴","台州","舟山","丽水","其它"],
		安徽省:["合肥","芜湖","蚌埠","阜阳","淮南","淮北","六安","马鞍山","铜陵","安庆","其它"],
		福建省:["福州","厦门","泉州","漳州","龙岩","南平","宁德","莆田","三明","其它"],
		江西省:["南昌","九江","新余","赣州","景德镇","上饶","抚州","宜春","吉安","鹰潭","其它"],
		山东省:["济南","青岛","淄博","德州","烟台","潍坊","济宁","枣庄","日照","莱芜","其它"],
		河南省:["洛阳","焦作","开封","南洋","平顶山","三门峡","商丘","许昌","郑州","驻马店","其它"],
		湖北省:["武汉","宜昌","十堰","咸宁","黄石","黄冈","襄阳","宜城","襄樊","荆州","其它"],
		湖南省:["长沙","株洲","湘潭","常德","衡阳","岳阳","怀化","永州","自治州","张家界","其它"],
		广东省:["广州","深圳","佛山","东莞","湛江","汕头","珠海","从化","秦信","其它"],
		广西壮族自治区:["南宁","桂林","柳州","百色","北海","北流","防城港","鹿寨","陆川","平果","其它"],
		海南省:["海口","琼山","临高","文昌","昌江","白沙","琼中","三亚","陵水","琼海","其它"],
		四川省:["成都","德阳","绵阳","攀枝花","泸州","南充","自贡","内江","乐山","西昌","其它"],
		贵州省:["贵阳","安顺","都匀","六盘山","仁怀","兴义","遵义","其它"],
		云南省:["昆明","大理","开远","丽江纳西族自治县","曲靖","西双版纳","宣威","玉溪","其它"],
		西藏自治区:["拉萨","其它"],
		陕西省:["西安","宝鸡","汉中","华阴","渭南","咸阳","其它"],
		甘肃省:["兰州","天水","白银","金昌","酒泉","嘉峪关","平凉","陇南","甘南","定西","其它"],
		青海省:["西宁市","海东地区","海西州","海北州","海南州","黄南州","玉树州","果洛州","格尔木市","德令哈市","其它"],
		宁夏回族自治区:["银川","吴忠","石嘴山","其它"],
		新疆维吾尔自治区:["乌鲁木齐", "阿勒泰", "昌吉", "呼图壁", "克拉玛依", "其它"] };
		
		
//	 ",:;=AO[]abceijloprtuvy{}三上丘东中临丹丽义乌乐九云亚京仁从令伊余佛作佳依保信充克六兰关兴其内冈凉勒匀包化北区十华南博原厦县双口古台合吉同吴吾呼和咸哈唐商嘉嘴四回图地圳坊城埠堰壁壮夏大天太头威嫩宁它安定宜宝宣家寨封尔山岛岩岭岳峡峪峰川州市常平广庄庆店廊延建开张徐德徽忠忻怀成或扬承抚拉攀政文斯新族无日昆昌明春景曲木本杭松林果枝枣柳树株格桂樊武水永汉汕江汾沈沙沧河治泉波泰泸泽洋洛津洲流济浙浩海淄淮深温渭港湖湘湛湾源溪滨漳潍潭澳烟焦照版牡特玉玛珠理琼甘田界疆白百皇盘直省石福秦级纳绍绥维绵肃肥胜自舟色芜花苏荆莆莞莱营萨蒙藏蚌行衡襄西许谷贡贵赣赤辖边辽远连通遵邢邯郑郸都酒重金铁铜银锡锦镇长门阜防阳阴阿陆陇陕陵青靖鞍顶顺饶香马驻高鲁鸡鹰鹿黄黑齐龙